In [2]:
import pandas as pd
import numpy as np

# Creating dataframe objects

In [3]:
arr = np.random.randint(0,10,(5,3))
arr

array([[5, 3, 5],
       [4, 4, 5],
       [5, 4, 4],
       [0, 7, 9],
       [6, 0, 8]])

In [4]:
df = pd.DataFrame(arr) #creating dataframe of arr

In [6]:
df

   0  1  2
0  5  3  5
1  4  4  5
2  5  4  4
3  0  7  9
4  6  0  8

In [7]:
df.values #printing dataframe in form of an array

array([[5, 3, 5],
       [4, 4, 5],
       [5, 4, 4],
       [0, 7, 9],
       [6, 0, 8]])

In [8]:
df.index #range of index

RangeIndex(start=0, stop=5, step=1)

In [9]:
df.columns #range of columns

RangeIndex(start=0, stop=3, step=1)

In [10]:
for c in df.columns:
    print(c)

0
1
2

In [11]:
df.values[1]

array([4, 4, 5])

In [12]:
df.index = ['R1', 'R2', 'R3', 'R4', 'R5']
df.columns = ['C1', 'C2', 'C3'] #defining columns and indexs

In [13]:
df

    C1  C2  C3
R1   5   3   5
R2   4   4   5
R3   5   4   4
R4   0   7   9
R5   6   0   8

In [14]:
df.loc['R2','C3']

5

In [15]:
df.iloc[1,2]

5

In [16]:
df.loc['R3':'R5', 'C2':'C3']

    C2  C3
R3   4   4
R4   7   9
R5   0   8

In [17]:
df.iloc[0]

C1    5
C2    3
C3    5
Name: R1, dtype: int32

In [18]:
df.iloc[:,0]

R1    5
R2    4
R3    5
R4    0
R5    6
Name: C1, dtype: int32

In [19]:
df.shape

(5, 3)

In [20]:
df.T #transform the dataframe

    R1  R2  R3  R4  R5
C1   5   4   5   0   6
C2   3   4   4   7   0
C3   5   5   4   9   8

In [34]:
mass = pd.Series([0.33, 4.87, 5.97, 0.642, 1898, 568, 86.8, 102, 0.0146], 
                 index=['Mercury', 'Venus', 'Earth', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])
diameter = pd.Series([4879, 12104, 12756, 3475, 6792, 142984, 120536, 51118, 49528, 2370], 
                     index=['Mercury', 'Venus', 'Earth', 'Moon', 'Mars', 'Jupiter', 'Saturn', 'Uranus', 'Neptune', 'Pluto'])

In [22]:
mass

Mercury       0.3300
Venus         4.8700
Earth         5.9700
Mars          0.6420
Jupiter    1898.0000
Saturn      568.0000
Uranus       86.8000
Neptune     102.0000
Pluto         0.0146
dtype: float64

In [35]:
diameter

Mercury      4879
Venus       12104
Earth       12756
Moon         3475
Mars         6792
Jupiter    142984
Saturn     120536
Uranus      51118
Neptune     49528
Pluto        2370
dtype: int64

In [36]:
df=pd.DataFrame({'Mass':mass,'Diameter':diameter})
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104

In [37]:
df['Mass']#printing only Mass column

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [38]:
df['Diameter']

Earth       12756
Jupiter    142984
Mars         6792
Mercury      4879
Moon         3475
Neptune     49528
Pluto        2370
Saturn     120536
Uranus      51118
Venus       12104
Name: Diameter, dtype: int64

In [39]:
df['Mass']['Earth'] #getting the mass of earth

5.97

In [40]:
df.Mass.Earth #alternative way

5.97

In [64]:
df['pop']=0 #adding 3rd column 
df

              Mass  Diameter  pop
Earth       5.9700     12756    0
Jupiter  1898.0000    142984    0
Mars        0.6420      6792    0
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [65]:
df['pop']['Earth'] = 800
df['pop']['Jupiter'] = 800
df['pop']['Mars'] = 800 #adding values to pop column

C:\Users\Varchasa Aggarwal\AppData\Local\Programs\Python\Python36\Lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
C:\Users\Varchasa Aggarwal\AppData\Local\Programs\Python\Python36\Lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

C:\Users\Varchasa Aggarwal\AppData\Local\Programs\Python\Python36\Lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [66]:
df

              Mass  Diameter  pop
Earth       5.9700     12756  800
Jupiter  1898.0000    142984  800
Mars        0.6420      6792  800
Mercury     0.3300      4879    0
Moon           NaN      3475    0
Neptune   102.0000     49528    0
Pluto       0.0146      2370    0
Saturn    568.0000    120536    0
Uranus     86.8000     51118    0
Venus       4.8700     12104    0

In [48]:
df['Mass'] is df.Mass

True

In [67]:
df['pop'] is df.pop

False

In [50]:
df.loc['Earth']

Mass            5.97
Diameter    12756.00
pop           800.00
Name: Earth, dtype: float64

In [51]:
df.loc[:,'Mass']

Earth         5.9700
Jupiter    1898.0000
Mars          0.6420
Mercury       0.3300
Moon             NaN
Neptune     102.0000
Pluto         0.0146
Saturn      568.0000
Uranus       86.8000
Venus         4.8700
Name: Mass, dtype: float64

In [60]:
np.mean(df['Mass']) #mean of column Mass

296.29184444444445

In [68]:
df.drop('pop',axis=1,inplace=True) #removing a column

In [69]:
df

              Mass  Diameter
Earth       5.9700     12756
Jupiter  1898.0000    142984
Mars        0.6420      6792
Mercury     0.3300      4879
Moon           NaN      3475
Neptune   102.0000     49528
Pluto       0.0146      2370
Saturn    568.0000    120536
Uranus     86.8000     51118
Venus       4.8700     12104